Revit 2027 API
TriangulatedSolidOrShell.ShellComponentCount Property
 The number of TriangulatedShellComponents that this TriangulatedSolidOrShell contains.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ShellComponentCount { get; }
Public ReadOnly Property ShellComponentCount As Integer
	Get
public:
property int ShellComponentCount {
	int get ();
}
member ShellComponentCount : int with get
Property Value
Int32
See Also
Reference
TriangulatedSolidOrShell Class
Autodesk.Revit.DB Namespace